#+TITLE: Introduction to data structures
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: CSC 240 - Data structures with C++ - Lyon College, FA24
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:1 num:1 ^:nil
#+PROPERTY: header-args:C++ :main yes :includes <iostream> :results output :exports both :noweb yes
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :noweb yes
* Data structures matter

- Different data structures have wildly differing properties and
  powers - compare for example *arrays* and *vectors* in C++.

- *C++ array vs. vector:*
  1) *Arrays* are collection of elements of the same type, stored in
     contiguous memory locations. They are used to store multiple
     values in one variable. Values can be accessed using an
     index. The size of the array is determined at compile-time.
  2) *Vectors* are dynamic arrays provided by the C++ Standard Template
     Library (STL). They can grow and shrink in size dynamically as
     elements are added or removed, that is at run-time. They offer
     useful member functions.

- *Array* code example: declare and initialize an array using a =for= loop.
  #+begin_src C++ :main yes :includes <iostream> :namespaces std :results output :exports both
    // declare array of 5 integers and initialize it to 0
    int array[5]{};

    // assign values to the array using a traditional for loop
    for (int index=0; index < 5; index++) {
      array[index] = index + 100;
     }

    // print initialized array using a range-based for loop
    for (int value : array) cout << value << " ";
  #+end_src

  #+RESULTS:
  : 100 101 102 103 104 

 - *Vector* code example:
  #+begin_src C++ :main yes :includes <iostream> :namespaces std :results output :exports both
    #include <vector>

    int main() {
      // create integer vector
      vector<int> myVector;

      // Adding elements to the vector
      for (int i = 0; i < 5; ++i) {
        myVector.push_back(i + 100);
      }

      // Accessing and printing elements
      for (int i = 0; i < myVector.size(); ++i) {
        cout << myVector[i] << " ";
      }

      return 0;
    }
  #+end_src

  #+RESULTS:
  : 100 101 102 103 104

- If C++ is not (yet) your mojo, think of the difference between
  *lists*, *tuples*, and *dictionaries* in Python:
  1) *list* elements can be of any data type, but *tuple* elements must
     have the same data type.
  2) *list* elements are ordered (indexed), but *dictionaries* are unordered.
  3) *lists* are mutable (can be modified), but *tuples* are immutable.
  4) *lists* are passed by reference, but *tuples* are passed by value.

- Code examples:
  #+begin_src python :python python3 :session *Python* :results output
    # list elements can have any data type
    foo = [1, "Hello", 'A', True]
    # lists are ordered
    print(foo[0], foo[1], foo[2], foo[3])
    # lists are mutable
    foo[2] = 'B'
    print(foo)
    # lists are passed by reference (not by value)
    bar = foo; bar[1]=2; print(foo) # change value in bar - copied to foo
  #+end_src

  #+RESULTS:
  : 1 Hello A True
  : [1, 'Hello', 'B', True]
  : [1, 2, 'B', True]

- R is another interesting example: the central data structure is the
  vector; defining and manipulating vectors is made very simple, and
  as an added plus, R indices start from 1 instead of 0:
  #+begin_src R :session *R* :results output :exports both
    foo <- c(1,3,-100,42)  # defining a vector
    foo  # printing vector
    bar <- c(foo, foo)  # extending the vector
    foo / 2 # vectorization: element-wise operations and implicit conversion
    matrix(1:16,4) # a 4 x 4 matrix. Full command: matrix(data=1:16,nrow=4)
  #+end_src

  #+RESULTS:
  : [1]    1    3 -100   42
  : [1]   0.5   1.5 -50.0  21.0
  :      [,1] [,2] [,3] [,4]
  : [1,]    1    5    9   13
  : [2,]    2    6   10   14
  : [3,]    3    7   11   15
  : [4,]    4    8   12   16

  
- Unlike C/C++ and Python, a lot of visualization options are already
  built into R.

- Graphics depend on data structures, too! Compare e.g. the SVG
  (Scalable Vector Graphics) image format whose images are represented
  not as a grid of pixels but using geometric shapes (points, lines,
  curves, polygons). Advantage: images are scalable to any size
  without loss of quality.

